Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.vm.layout.applyTheLayoutIsAppliedToWorkspace
source: vm layout apply: the layout is applied to workspace %1$@ on %2$@, but it could not be opened here yet (%3$@). Open it with: cmux vm workspace open %4$@ %5$@
ar: vm layout apply: تم تطبيق التخطيط على مساحة العمل %1$@ على %2$@، ولكن تعذر فتحها هنا بعد (%3$@). افتحها باستخدام: cmux vm workspace open %4$@ %5$@
de: vm layout apply: Das Layout wurde auf den Arbeitsbereich %1$@ auf %2$@ angewendet, konnte hier aber noch nicht geöffnet werden (%3$@). Öffnen Sie ihn mit: cmux vm workspace open %4$@ %5$@
es: vm layout apply: el diseño se ha aplicado al espacio de trabajo %1$@ en %2$@, pero aún no se ha podido abrir aquí (%3$@). Ábralo con: cmux vm workspace open %4$@ %5$@
fr: vm layout apply: la disposition est appliquée à l'espace de travail %1$@ sur %2$@, mais elle n'a pas encore pu être ouverte ici (%3$@). Ouvrez-la avec : cmux vm workspace open %4$@ %5$@
ja: vm layout apply: レイアウトはワークスペース %1$@ (%2$@ 上) に適用されましたが、ここではまだ開くことができませんでした (%3$@)。次のコマンドで開いてください: cmux vm workspace open %4$@ %5$@
ko: vm layout apply: 레이아웃이 작업 공간 %1$@(%2$@)에 적용되었으나, 아직 여기에서 열 수 없습니다 (%3$@). 다음 명령으로 여십시오: cmux vm workspace open %4$@ %5$@
zh_hans: 布局已应用到工作区 %1$@（机器 %2$@），但暂时无法在此打开（%3$@）。请使用以下命令打开：cmux vm workspace open %4$@ %5$@
zh_hant: 配置已套用至工作區 %1$@（機器 %2$@），但目前尚無法在此開啟（%3$@）。請使用以下指令開啟：cmux vm workspace open %4$@ %5$@

# cli.vm.layout.applyTheLayoutWasAppliedButTheMachine
source: vm layout apply: the layout was applied but the machine reported no workspace id to open (output: %1$@)
ar: vm layout apply: تم تطبيق التخطيط ولكن لم تبلغ الآلة عن أي workspace id لفتحه (المخرجات: %1$@)
de: vm layout apply: Das Layout wurde angewendet, aber die Maschine hat keine Arbeitsbereich-ID zum Öffnen gemeldet (Ausgabe: %1$@)
es: vm layout apply: el diseño se aplicó pero la máquina no reportó ningún id de espacio de trabajo para abrir (salida: %1$@)
fr: vm layout apply: la disposition a été appliquée mais la machine n'a renvoyé aucun identifiant d'espace de travail à ouvrir (sortie : %1$@)
ja: vm layout apply: レイアウトは適用されましたが、マシンから開くべきワークスペース ID が返されませんでした (出力: %1$@)
ko: vm layout apply: 레이아웃이 적용되었으나 머신이 열 작업 공간 ID를 보고하지 않았습니다 (출력: %1$@)
zh_hans: vm layout apply: 布局已应用，但机器未报告要打开的工作区 ID (输出：%1$@)
zh_hant: vm layout apply: 已套用版面配置，但機器回報沒有可開啟的工作區識別碼 (輸出: %1$@)

# cli.vm.layout.applyUnknownFlag
source: vm layout apply: unknown flag '%1$@' %2$@
ar: vm layout apply: علامة غير معروفة '%1$@' %2$@
de: vm layout apply: Unbekanntes Flag '%1$@' %2$@
es: vm layout apply: opción desconocida '%1$@' %2$@
fr: vm layout apply: option inconnue '%1$@' %2$@
ja: vm layout apply: 不明なフラグ '%1$@' %2$@
ko: vm layout apply: 알 수 없는 플래그 '%1$@' %2$@
zh_hans: vm layout apply: 未知标志 '%1$@' %2$@
zh_hant: vm layout apply: 未知的旗標 '%1$@' %2$@

# cli.vm.layout.documentError
source: %1$@ at %2$@
ar: %1$@ في %2$@
de: %1$@ bei %2$@
es: %1$@ en %2$@
fr: %1$@ à %2$@
ko: %1$@ (위치: %2$@)
zh_hans: %1$@ 位于 %2$@
zh_hant: %1$@ 位於 %2$@

# cli.vm.layout.exportUnknownFlag
source: vm layout export: unknown flag '%1$@' %2$@
ar: vm layout export: علامة غير معروفة '%1$@' %2$@
de: vm layout export: Unbekanntes Flag '%1$@' %2$@
es: vm layout export: opción desconocida '%1$@' %2$@
fr: vm layout export: option inconnue '%1$@' %2$@
ja: vm layout export: 不明なフラグ '%1$@' %2$@
ko: vm layout export: 알 수 없는 플래그 '%1$@' %2$@
zh_hans: vm layout export: 未知标志 '%1$@' %2$@
zh_hant: vm layout export: 未知的旗標 '%1$@' %2$@

# cli.vm.layout.unknownVerb
source: vm layout: unknown verb '%1$@' %2$@
ar: vm layout: فعل غير معروف '%1$@' %2$@
de: vm layout: Unbekanntes Verb '%1$@' %2$@
es: vm layout: verbo desconocido '%1$@' %2$@
fr: vm layout: verbe inconnu '%1$@' %2$@
ja: vm layout: 不明なサブコマンド '%1$@' %2$@
ko: vm layout: 알 수 없는 명령 '%1$@' %2$@
zh_hans: vm layout: 未知动词 '%1$@' %2$@
zh_hant: vm layout: 未知的動詞 '%1$@' %2$@

# cli.vm.layout.usage
source: Usage: cmux vm layout export <machine> [<workspace-id|name>] [--raw] Print a machine workspace's layout as a declarative layout document — the same JSON `cmux new-workspace --layout`, `cmux layout save/open`, and cmux.json use. Default: the machine's focused workspace. --raw prints the daemon's own LayoutDocument (exact pane/tab ids) instead. cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] Build panes, splits, and tabs on the machine from a layout document: a file, stdin (-), or a layout saved on this Mac (`cmux layout list`). Default: a NEW machine workspace named after the document (--name overrides); --workspace targets an existing EMPTY workspace. Terminal `command`s are typed into login shells started in each surface's `cwd` (relative to --cwd, default: the work user's home). --open then opens the workspace here with the same geometry. Document (one of): {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} or {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = side by side (first child left), `vertical` = stacked (first child top); `split` is the first child's share (0.1–0.9, default 0.5). Surface types: terminal (name, command, cwd, env), browser (url, name); project surfaces are Mac-only and skipped on a machine. Workspace ids come from `cmux vm tree`. Add --json for the raw result. Exit 2 = the document is invalid.
ar: الاستخدام: cmux vm layout export <machine> [<workspace-id|name>] [--raw] طباعة تخطيط مساحة عمل الجهاز كتخطيط تصريحي مستند — وهو نفس الـ JSON الذي يستخدمه `cmux new-workspace --layout`، و `cmux layout save/open` و cmux.json. الافتراضي: التي عليها التركيز للجهاز. يطبع --raw مستند التخطيط الخاص بالخادم الخفي نفسه LayoutDocument (معرّفات الألواح/علامات التبويب الدقيقة) بدلاً من ذلك. cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] بناء الألواح، والانقسامات، وعلامات التبويب على الجهاز من تخطيط مستند: ملف، أو stdin (-)، أو تخطيط محفوظ على جهاز Mac هذا (`cmux layout list`). الافتراضي: مساحة عمل جديدة للجهاز باسم المستند (يقوم --name بالتجاوز)؛ ويستهدف --workspace مساحة عمل فارغة EMPTY موجودة بالفعل. تُكتب `command` الخاصة بالطرفية في قشور تسجيل الدخول التي تبدأ في الـ `cwd` لكل سطح (بالنسبة إلى --cwd، الافتراضي: دليل منزل مستخدم العمل). ثم يفتح --open مساحة العمل هنا بنفس الأبعاد الهندسية. مستند (أحد ما يلي): {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} أو {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = جنبًا إلى جنب (الابن الأول يسارًا)، `vertical` = مكدس (الابن الأول بالأعلى)؛ و `split` يمثل حصة الابن الأول (0.1–0.9، الافتراضي 0.5). أنواع الأسطح: terminal (name, command, cwd, env)، و browser (url, name)؛ وأسطح المشاريع مخصصة لنظام Mac فقط ويتم تخطيها على الجهاز. تأتي معرفات مساحات العمل من `cmux vm tree`. أضف --json للحصول على النتيجة الخام. الرمز Exit 2 = المستند غير صالح.
de: Verwendung: cmux vm layout export <machine> [<workspace-id|name>] [--raw] Das Layout eines Maschinen-Arbeitsbereichs als deklaratives Layoutdokument ausgeben — dasselbe JSON, das `cmux new-workspace --layout`, `cmux layout save/open` und cmux.json verwenden. Standard: der fokussierte Arbeitsbereich der Maschine. --raw gibt stattdessen das eigene LayoutDocument des Daemons (exakte Bereichs-/Tab-IDs) aus. cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] Bereiche, Splits und Tabs auf der Maschine aus einem Layoutdokument erstellen: eine Datei, stdin (-) oder ein auf diesem Mac gespeichertes Layout (`cmux layout list`). Standard: ein NEUER Maschinen-Arbeitsbereich, benannt nach dem Dokument (--name überschreibt); --workspace zielt auf einen bestehenden LEEREN Arbeitsbereich ab. Terminal-`command`s werden in Login-Shells eingegeben, die im `cwd` jeder Oberfläche gestartet werden (relativ zu --cwd, Standard: das Home-Verzeichnis des Arbeitsbenutzers). --open öffnet dann den Arbeitsbereich hier mit derselben Geometrie. Dokument (eines von): {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} oder {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = nebeneinander (erstes Child links), `vertical` = gestapelt (erstes Child oben); `split` ist der Anteil des ersten Childs (0.1–0.9, Standard 0.5). Oberflächentypen: terminal (name, command, cwd, env), browser (url, name); Projekt-Oberflächen sind nur für Mac verfügbar und werden auf einer Maschine übersprungen. Arbeitsbereichs-IDs stammen aus `cmux vm tree`. Fügen Sie --json für das rohe Ergebnis hinzu. Exit 2 = das Dokument ist ungültig.
es: Uso: cmux vm layout export <machine> [<workspace-id|name>] [--raw] Imprime la distribución de un espacio de trabajo de la máquina como un documento de distribución declarativo — el mismo JSON que usan `cmux new-workspace --layout`, `cmux layout save/open` y cmux.json. Por defecto: el espacio de trabajo enfocado de la máquina. --raw imprime el propio LayoutDocument (identificadores exactos de paneles/pestañas) en su lugar. cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] Construye paneles, divisiones y pestañas en la máquina a partir de un documento de distribución: un archivo, la entrada estándar (-) o una distribución guardada en este Mac (`cmux layout list`). Por defecto: un NUEVO espacio de trabajo de la máquina con el nombre del documento (puede anularse con --name); --workspace se dirige a un espacio de trabajo VACÍO existente. Los comandos (`command`) de la terminal se escriben en shells de inicio de sesión iniciados en el `cwd` de cada superficie (relativo a --cwd, por defecto: la carpeta de inicio del usuario de trabajo). --open luego abre el espacio de trabajo aquí con la misma geometría. Documento (uno de los siguientes): {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} o {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = uno al lado del otro (primer hijo a la izquierda), `vertical` = apilados (primer hijo arriba); `split` es la proporción del primer hijo (0.1–0.9, por defecto 0.5). Tipos de superficie: terminal (name, command, cwd, env), browser (url, name); las superficies de tipo proyecto son exclusivas de Mac y se omiten en una máquina. Los identificadores de espacio de trabajo provienen de `cmux vm tree`. Añada --json para obtener el resultado sin procesar. Exit 2 = el documento no es válido.
fr: Utilisation : cmux vm layout export <machine> [<workspace-id|name>] [--raw] Afficher l'agencement d'un espace de travail de machine sous forme de document d'agencement déclaratif — le même JSON qu'utilisent `cmux new-workspace --layout`, `cmux layout save/open` et cmux.json. Par défaut : l'espace de travail actif de la machine. --raw affiche le propre LayoutDocument (identifiants de volet/onglet exacts) du démon à la place. cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] Créer des volets, séparations et onglets sur la machine à partir d'un document d'agencement : un fichier, stdin (-) ou un agencement enregistré sur ce Mac (`cmux layout list`). Par défaut : un NOUVEL espace de travail de machine nommé d'après le document (--name prévaut) ; --workspace cible un espace de travail VIDE existant. Les `command`es de terminal sont saisies dans des shells de connexion démarrés dans le `cwd` de chaque surface (relatif à --cwd, par défaut : le répertoire personnel de l'utilisateur de travail). --open ouvre ensuite l'espace de travail ici avec la même géométrie. Document (l'un des suivants) : {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} ou {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = côte à côte (premier enfant à gauche), `vertical` = empilé (premier enfant en haut) ; `split` représente la part du premier enfant (0.1–0.9, par défaut 0.5). Types de surface : terminal (name, command, cwd, env), browser (url, name) ; les surfaces de projet sont réservées au Mac et ignorées sur une machine. Les identifiants d'espace de travail proviennent de `cmux vm tree`. Ajoutez --json pour obtenir le résultat brut. Code de sortie 2 = le document n'est pas valide.
ja: 使用法: cmux vm layout export <machine> [<workspace-id|name>] [--raw] マシンのワークスペースのレイアウトを、宣言的なレイアウト ドキュメント（`cmux new-workspace --layout`、 `cmux layout save/open`、および cmux.json が使用するものと同じ JSON）として出力します。デフォルト: マシンのフォーカスされたワークスペース。--raw は代わりにデーモン独自の LayoutDocument (正確なペイン/タブ ID) を出力します。 cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] レイアウトドキュメントから、マシン上にペイン、スプリット、およびタブを 構築します。対象: ファイル、標準入力 (-)、またはこの Mac に保存されたレイアウト (`cmux layout list`)。デフォルト: ドキュメント名にちなんで命名された新しいマシンのワークスペース (--name で上書き可能)。--workspace は既存 of 空のワークスペースを 対象とします。ターミナルの `command` は、各サーフェスの `cwd`（--cwd に対する相対パス、デフォルト: ワークユーザーのホーム）で起動された ログインシェルに入力されます。その後、--open は同じジオメトリで ここにあるワークスペースを開きます。 ドキュメント (いずれか): {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} または {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = 横並び (最初の子が左)、`vertical` = 縦並び (最初の子が上)。`split` は 最初の子の割合 (0.1–0.9、デフォルト 0.5) です。サーフェスの種類: terminal (name, command, cwd, env), browser (url, name)。project サーフェスは Mac 専用であり、マシン上ではスキップされます。 ワークスペース ID は `cmux vm tree` から取得されます。生の結果を得るには --json を追加します。終了コード 2 = ドキュメントが無効。
ko: 사용법: cmux vm layout export <machine> [<workspace-id|name>] [--raw] 머신 워크스페이스의 레이아웃을 선언적 레이아웃 문서로 출력합니다 — `cmux new-workspace --layout`, `cmux layout save/open` 및 cmux.json에서 사용하는 것과 동일한 JSON입니다. 기본값: 머신의 포커스된 워크스페이스. --raw는 대신 데몬 자체의 LayoutDocument(정확한 창/탭 ID)를 출력합니다. cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] 레이아웃 문서로부터 머신에 창, 분할(split) 및 탭을 구축합니다: 문서: 파일, stdin (-) 또는 이 Mac에 저장된 레이아웃 (`cmux layout list`). 기본값: 문서 이름을 딴 새로운 머신 워크스페이스 (--name으로 재정의 가능); --workspace는 기존의 비어 있는 워크스페이스를 대상으로 합니다. 터미널 `command`들은 각 서피스의 `cwd`에서 시작된 로그인 셸에 입력됩니다 (이는 --cwd 기준이며, 기본값: 작업 사용자의 홈). 그런 다음 --open은 여기에서 동일한 구조(geometry)로 워크스페이스를 엽니다. 문서 (다음 중 하나): {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} 또는 {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = 가로 병렬 배치 (첫 번째 자식이 왼쪽), `vertical` = 세로 쌓음 배치 (첫 번째 자식이 위쪽); `split`은 첫 번째 자식의 비율(0.1–0.9, 기본값 0.5)입니다. 서피스(surface) 유형: terminal (name, command, cwd, env), browser (url, name); project 서피스는 Mac 전용이며 머신에서는 건너뜁니다. 워크스페이스 ID는 `cmux vm tree`에서 얻을 수 있습니다. 원시 결과를 보려면 --json을 추가하십시오. Exit 2 = 문서가 유효하지 않음.
zh_hans: 用法： cmux vm layout export <machine> [<workspace-id|name>] [--raw] 将机器工作区的布局打印为声明式布局 文档 —— 即 `cmux new-workspace --layout`、 `cmux layout save/open` 以及 cmux.json 所使用的相同 JSON。默认值：该 机器当前聚焦的工作区。--raw 则会打印守护进程自身的 LayoutDocument（精确的窗格/标签页 id）代替。 cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] 根据布局文档在机器上构建窗格、拆分和标签页： 该文档可以是文件、标准输入（-）或保存在此 Mac 上的布局 （`cmux layout list`）。默认值：一个以该文档命名的全新机器工作区 （--name 可覆盖此名称）；--workspace 则用于指定一个 已存在的空（EMPTY）工作区。终端的 `command` 会在 在每个 surface 的 `cwd`（相对于 --cwd，默认值：工作用户的家目录）中启动的登录 shell 内输入。--open 随后会在此处打开该工作区， 并具有相同的几何布局。 文档（以下之一）： {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} 或 {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = 并排（第一个子项在左），`vertical` = 堆叠（第一个子项在上）；`split` 是 第一个子项的份额（0.1–0.9，默认值为 0.5）。Surface 类型：terminal (name, command, cwd, env)， browser (url, name)；project surface 仅限 Mac，在机器上会被跳过。 工作区 id 来自 `cmux vm tree`。添加 --json 以获取原始结果。Exit 2 = 该文档无效。
zh_hant: 用法： cmux vm layout export <machine> [<workspace-id|name>] [--raw] 將機器工作區的版面配置列印為宣告式版面配置 文件 — 也就是 `cmux new-workspace --layout`、 `cmux layout save/open` 以及 cmux.json 所使用的同一個 JSON。預設值： 機器目前聚焦的工作區。--raw 則會改為列印精靈程序本身的 LayoutDocument（精確的窗格/索引標籤 ID）。 cmux vm layout apply <machine> (<file>|- | --from-saved <name>) [--workspace <workspace-id>|--name <name>] [--cwd <dir>] [--open] 在機器上從版面配置 文件建立窗格、分割和索引標籤：檔案、標準輸入 (-) 或儲存在此 Mac 上的版面配置 （`cmux layout list`）。預設值：一個以該 文件命名的全新機器工作區（可用 --name 覆寫）；--workspace 則是指定一個 現有的空白工作區。終端機的 `command` 會被輸入到 在每個介面的 `cwd` 中啟動的登入 shell 中（相對於 --cwd，預設值：該工作使用者的家目錄）。接著 --open 會在此處開啟工作區， 並具有相同的幾何尺寸。 文件（其中之一）： {"pane": {"surfaces": [{"type": "terminal", "name": "tests", "command": "bun test", "cwd": "work/app"}]}} {"direction": "horizontal"|"vertical", "split": 0.6, "children": [<node>, <node>]} {"name": …, "cwd": …, "layout": <node>} 或 {"name": …, "workspace": {"cwd": …, "layout": <node>}} `horizontal` = 並排（第一個子項目在左側），`vertical` = 堆疊（第一個子項目在頂部）；`split` 是第一個 子項目的佔比（0.1–0.9，預設為 0.5）。介面類型：terminal (name, command, cwd, env)、 browser (url, name)；專案介面僅限 Mac，且在機器上會被跳過。 工作區 ID 來自 `cmux vm tree`。加入 --json 來取得原始結果。Exit 2 = 文件無效。

# cli.vm.layoutEnv.browserSurfaceNeedsUrl
source: browser surface needs url
ar: سطح المتصفح بحاجة إلى عنوان URL
de: Browser-Surface benötigt eine URL
es: la superficie del navegador necesita una URL
fr: la surface du navigateur a besoin d'une URL
ja: ブラウザサーフェスには URL が必要です
ko: 브라우저 서피스에 url이 필요합니다
zh_hans: 浏览器 surface 需要 url
zh_hant: 瀏覽器表面需要 url

# cli.vm.layoutEnv.childrenMustBeAnArrayOfExactly2LayoutNodes
source: 'children' must be an array of exactly 2 layout nodes
ar: يجب أن تكون 'children' مصفوفة من عقدتي تخطيط بالضبط
de: 'children' muss ein Array aus genau 2 Layout-Knoten sein
es: 'children' debe ser un arreglo de exactamente 2 nodos de diseño
fr: 'children' doit être un tableau d'exactement 2 nœuds de disposition
ja: 'children' はちょうど 2 つのレイアウトノードの配列である必要があります
ko: 'children'은 정확히 2개의 레이아웃 노드로 구성된 배열이어야 합니다
zh_hans: 'children' 必须是恰好包含 2 个布局节点的数组
zh_hant: 'children' 必須是剛好包含 2 個版面配置節點的陣列

# cli.vm.layoutEnv.cmuxValueFailedOnValueExitValue
source: cmux %1$@ failed on %2$@ (exit %3$@)
ar: فشل cmux %1$@ على %2$@ (رمز الخروج %3$@)
de: cmux %1$@ fehlgeschlagen bei %2$@ (Exit %3$@)
es: cmux %1$@ falló en %2$@ (salida %3$@)
fr: cmux %1$@ a échoué sur %2$@ (exit %3$@)
ja: cmux %1$@ が %2$@ で失敗しました (終了ステータス %3$@)
ko: cmux %1$@이(가) %2$@에서 실패했습니다 (종료 코드 %3$@)
zh_hans: cmux %1$@ 在 %2$@ 上失败 (退出 %3$@)
zh_hant: cmux %1$@ 於 %2$@ 失敗 (結束碼 %3$@)

# cli.vm.layoutEnv.directionMustBeHorizontalOrVertical
source: 'direction' must be "horizontal" or "vertical"
ar: يجب أن تكون 'direction' إما "horizontal" أو "vertical"
de: 'direction' muss "horizontal" oder "vertical" sein
es: 'direction' debe ser "horizontal" o "vertical"
fr: 'direction' doit être "horizontal" ou "vertical"
ja: 'direction' は "horizontal" または "vertical" である必要があります
ko: 'direction'은 "horizontal" 또는 "vertical"이어야 합니다
zh_hans: 'direction' 必须为 "horizontal" 或 "vertical"
zh_hant: 'direction' 必須為 "horizontal" 或 "vertical"

# cli.vm.layoutEnv.envMustBeAnObjectOfStringValues
source: 'env' must be an object of string values
ar: يجب أن تكون 'env' كائناً من قيم نصية
de: 'env' muss ein Objekt mit String-Werten sein
es: 'env' debe ser un objeto de valores de cadena
fr: 'env' doit être un objet de valeurs de type chaîne
ja: 'env' は文字列値のオブジェクトである必要があります
ko: 'env'는 문자열 값으로 구성된 객체여야 합니다
zh_hans: 'env' 必须是一个值均为字符串的对象
zh_hant: 'env' 必須是字串值的物件

# cli.vm.layoutEnv.expectedKEYVALUEGotValue
source: expected KEY=VALUE, got '%1$@'
ar: متوقع KEY=VALUE، ولكن تم تلقي '%1$@'
de: KEY=VALUE erwartet, '%1$@' erhalten
es: se esperaba CLAVE=VALOR, se obtuvo '%1$@'
fr: KEY=VALUE attendu, reçu '%1$@'
ja: KEY=VALUE が期待されましたが、'%1$@' が指定されました
ko: KEY=VALUE 형식을 예상했으나 '%1$@'을(를) 받았습니다
zh_hans: 预期为 KEY=VALUE，但收到 '%1$@'
zh_hant: 預期為 KEY=VALUE，但取得 '%1$@'

# cli.vm.layoutEnv.focusMustBeTrueOrFalse
source: 'focus' must be true or false
ar: يجب أن تكون 'focus' إما true أو false
de: 'focus' muss true oder false sein
es: 'focus' debe ser true o false
fr: 'focus' doit être true ou false
ja: 'focus' は true または false である必要があります
ko: 'focus'는 true 또는 false여야 합니다
zh_hans: 'focus' 必须为 true 或 false
zh_hant: 'focus' 必須為 true 或 false

# cli.vm.layoutEnv.invalidVariableNameValueKeysMatchAZaZA
source: invalid variable name '%1$@' (keys match [A-Za-z_][A-Za-z0-9_]*)
ar: اسم متغير غير صالح '%1$@' (تطابق المفاتيح [A-Za-z_][A-Za-z0-9_]*)
de: ungültiger Variablenname '%1$@' (Schlüssel entsprechen [A-Za-z_][A-Za-z0-9_]*)
es: nombre de variable no válido '%1$@' (las claves coinciden con [A-Za-z_][A-Za-z0-9_]*)
fr: nom de variable invalide '%1$@' (les clés correspondent à [A-Za-z_][A-Za-z0-9_]*)
ja: 無効な変数名 '%1$@' です (キーは [A-Za-z_][A-Za-z0-9_]* に一致する必要があります)
ko: 유효하지 않은 변수 이름 '%1$@' (키가 [A-Za-z_][A-Za-z0-9_]*과 일치해야 함)
zh_hans: 无效的变量名 '%1$@' (键匹配 [A-Za-z_][A-Za-z0-9_]*)
zh_hant: 無效的變數名稱 '%1$@' (鍵值須符合 [A-Za-z_][A-Za-z0-9_]*)

# cli.vm.layoutEnv.layoutDocumentMustBeAJSONObject
source: layout document must be a JSON object
ar: يجب أن يكون مستند التخطيط كائن JSON
de: Layout-Dokument muss ein JSON-Objekt sein
es: el documento de diseño debe ser un objeto JSON
fr: le document de disposition doit être un objet JSON
ja: レイアウトドキュメントは JSON オブジェクトである必要があります
ko: 레이아웃 문서는 JSON 객체여야 합니다
zh_hans: 布局文档必须是一个 JSON 对象
zh_hant: 版面配置文件必須是 JSON 物件

# cli.vm.layoutEnv.layoutMustBeALayoutNodeObject
source: 'layout' must be a layout node object
ar: يجب أن تكون 'layout' كائن عقدة تخطيط
de: 'layout' muss ein Layout-Knoten-Objekt sein
es: 'layout' debe ser un objeto de nodo de diseño
fr: 'layout' doit être un objet nœud de disposition
ja: 'layout' はレイアウトノードオブジェクトである必要があります
ko: 'layout'은 레이아웃 노드 객체여야 합니다
zh_hans: 'layout' 必须是一个布局节点对象
zh_hant: 'layout' 必須是版面配置節點物件

# cli.vm.layoutEnv.layoutNodeMustBeAnObject
source: layout node must be an object
ar: يجب أن تكون عقدة التخطيط كائناً
de: Layout-Knoten muss ein Objekt sein
es: el nodo de diseño debe ser un objeto
fr: le nœud de disposition doit être un objet
ja: レイアウトノードはオブジェクトである必要があります
ko: 레이아웃 노드는 객체여야 합니다
zh_hans: 布局节点必须是一个对象
zh_hant: 版面配置節點必須是物件

# cli.vm.layoutEnv.layoutNodeMustNotHaveBothPaneAndDirection
source: layout node must not have both 'pane' and 'direction'
ar: يجب ألا تحتوي عقدة التخطيط على كل من 'pane' و 'direction' معاً
de: Layout-Knoten darf nicht sowohl 'pane' als auch 'direction' enthalten
es: el nodo de diseño no debe tener tanto 'pane' como 'direction'
fr: le nœud de disposition ne doit pas avoir à la fois 'pane' et 'direction'
ja: レイアウトノードに 'pane' と 'direction' の両方を指定することはできません
ko: 레이아웃 노드는 'pane'과 'direction'을 모두 가질 수 없습니다
zh_hans: 布局节点不能同时具有 'pane' 和 'direction'
zh_hant: 版面配置節點不能同時包含 'pane' 與 'direction'
